In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_table("data.txt")

In [10]:
df2=pd.read_table("data2.txt")#the first line of text is treated as the header
df2

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

In [11]:
df=pd.read_table("data2.txt",sep=",")#seperates the values according toa  delimiter
df

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [12]:
df=pd.read_table("data2.txt",sep=",",header=None)
df

      0   1  2
0   Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F

In [14]:
df=pd.read_table("data2.txt",sep=",",header=None,names=["name","score","sex"])#sets the headers
df

   name  score sex
0   Tom     80   M
1   Tim     85   M
2   Kim     70   M
3  Kate     90   F
4  Alex     75   F